/********************************************************************************
**
** 文件名:     drv_esp8266.h
** 版权所有:   (c) 2013-2016 
** 文件描述:   esp8266驱动，采用透传模式，方便开发，但是只能支持一条连接
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**|    日期    |  作者  |  修改记录
**===============================================================================
**| 2016/12/09 | 苏友江 |  创建该文件
********************************************************************************/
#ifndef DRV_ESP8266_H
#define DRV_ESP8266_H

/*
********************************************************************************
* 定义模块配置参数
********************************************************************************
*/
#define AT_PARA_NUM       4
#define AT_PARA_SIZE      30

/*
********************************************************************************
* 定义模块结构
********************************************************************************
*/

typedef struct _At_cmd_t {
	INT8U  cmdid;		                      /* 命令序号 */
	INT8U *cmd;			                      /* 命令 */
	INT8U *scuesscode;	                      /* 成功码 */
	INT8U *errorcode;	                      /* 失败码 */
    INT32S timeout;                           /* 超时等待，单位ms */                      
	INT8U  paranum;		                      /* 需要参数的个数0为不需要参数 */
	void  *para;                              /* 参数指针 */
} At_cmd_t;

typedef enum
{
    AT_DOING,
	AT_OK,
	AT_FAIL,
	AT_TIMEOUT,
    AT_INVALID_PARAMS,
} At_ret;

/*******************************************************************
** 函数名:      drv_esp8266_init
** 函数描述:    
** 参数:        none
** 返回:        none
********************************************************************/
void drv_esp8266_init(void);

INT32S drv_esp8266_write(INT8U* pdata, INT16U datalen);

INT32S drv_esp8266_read(INT8U* pdata, INT16U datalen);

BOOLEAN drv_esp8266_is_connect(void);

BOOLEAN drv_esp8266_reset(INT8U delay);

BOOLEAN drv_esp8266_smartconfig(void);

BOOLEAN drv_esp8266_server(char *server);

BOOLEAN drv_esp8266_port(INT16U port);

#endif /* end of DRV_ESP8266_H */

