/********************************************************************************
**
** 文件名:     spi_w5500.c
** 版权所有:   (c) 2013-2015 
** 文件描述:   SPI驱动函数实现
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**|    日期    |  作者  |  修改记录
**===============================================================================
**| 2015/06/12 | 苏友江 |  创建该文件
********************************************************************************/
#ifndef SPI_W5500_H
#define SPI_W5500_H 

void spi_configuration(void);
 
void spi_write_byte(uint8_t byte);

uint8_t spi_read_byte(void);

void spi_crisenter(void);

void spi_crisexit(void);
  
void spi_cs_select(void);

void spi_cs_deselect(void); 

void reset_w5500(void);

 
#endif
