/********************************************************************************
**
** 文件名:     drv_ethernet.h
** 版权所有:   (c) 2013-2015 
** 文件描述:   以太网驱动模块
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**|    日期    |  作者  |  修改记录
**===============================================================================
**| 2015/06/24 | 苏友江 |  创建该文件
********************************************************************************/
#ifndef DRV_ETHERNET_H
#define DRV_ETHERNET_H

void drv_ethernet_init(void);
 
INT32S drv_ethernet_write(INT8U* pdata, INT16U datalen);

INT32S drv_ethernet_read(INT8U* pdata, INT16U datalen);

BOOLEAN drv_ethernet_is_connect(void);

 
#ifdef ETHERNET_TEST
void test_loopback(void);
#endif

#endif

