/********************************************************************************
**
** 文件名:     sys_swconfig.h
** 版权所有:   (c) 2013-2014 
** 文件描述:   该模块主要实现各功能模块开关控制
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2016/03/16 | 苏友江 |  创建第一版本
*********************************************************************************/
#ifndef SYS_SWCONFIG_H
#define SYS_SWCONFIG_H           1

/*
*****************************************************************************************
*  注: 1.本文件用于.C文件中有需要用到宏开关地方
*      2.本文件必须放到.C的最顶端，否则在本文件之上定义的宏开关将失效，导致变异错误等问题
*      3.一定要避免有的.C中没包含该头文件，因为编译时不会警告的，会有隐含的bug，宏开关里面
*        的代码不会被编译进去(pp参数那边最容易出错)
*****************************************************************************************
*/



/*
*****************************************************************************************
*   版本号定义
*****************************************************************************************
*/
#define DEVICE_TYPE              1
#define HARDWARE_VERSION_STR     "hard-v1.0"
#define SOFTWARE_VERSION_STR     "0000"

/*
*****************************************************************************************
* 各功能模块的编译控制开关
*****************************************************************************************
*/
#define EN_CPU_USAGE         0         /* CPU使用率统计 */
#define EN_UPDATE            1         /* 远程升级 */

#define EN_ZIGBEE            0         /* ZIGBEE驱动 */
#define EN_WIFI              1         /* WIFI驱动 */
#define EN_ETHERNET          0         /* 以太网驱动 */
#define EN_YEELINK           0         /* YEELINK,打开前必须开启EN_ETHERNET或wifi */

#define EN_DALI              0         /* DALI调光 */

#define EN_NRF24L01          1         /* 无线网络 */


#endif /* end of SYS_SWCONFIG_H */

