/********************************************************************************
**
** 文件名:     net_link_send.h
** 版权所有:   (c) 2013-2014 
** 文件描述:   协议封装发送，发送链表管理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**|    日期    |  作者  |  修改记录
**===============================================================================
**| 2014/10/18 | 苏友江 |  创建该文件
********************************************************************************/
#ifndef NET_LINK_SEND_H
#define NET_LINK_SEND_H


/*******************************************************************
** 函数名:     net_link_send_init
** 函数描述:   link发送模块初始化
** 参数:       无
** 返回:       无
********************************************************************/
void net_link_send_init(void);

/*******************************************************************
** 函数名:     net_link_send_listsend
** 函数描述:   link数据链表发送
** 参数:       [in] type   : 协议类型
**             [in] packet : 数据指针
**             [in] ct_send: 发送次数
**             [in] ct_time: 重发等待时间，单位：秒
**             [in] fp     : 发送结果通知
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN net_link_send_listsend(INT8U type, PACKET_BUF_T *packet, INT8U ct_send, INT16U ct_time, void(*fp)(INT8U));

/*******************************************************************
** 函数名:     net_link_send_dirsend
** 函数描述:   直接发送，不挂到链表发送
** 参数:       [in] type  : 协议类型
**             [in] packet: 数据包
** 返回:       发送成功返回true，失败返回false
********************************************************************/
BOOLEAN net_link_send_dirsend(INT8U type, PACKET_BUF_T *packet);

/*******************************************************************
** 函数名:     net_link_send_confirm
** 函数描述:   应答确认
** 参数:       [in] type: 协议类型
**             [in] result: 结果
** 返回:       成功返回true，失败返回false
********************************************************************/
BOOLEAN net_link_send_confirm(INT8U type, PACKET_BUF_T *packet, INT8U result);

/*******************************************************************
** 函数名:      net_link_send_inform
** 函数描述:    通知收到数据
** 参数:        [in] node:
** 返回:        true or false
********************************************************************/
BOOLEAN net_link_send_inform(Net_link_node_t *node);

#endif /* end of LINK_SEND_H */
