/********************************************************************************
**
** 文件名:     net_link_node.h
** 版权所有:   (c) 2013-2014 
** 文件描述:   网络节点管理
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**|    日期    |  作者  |  修改记录
**===============================================================================
**| 2014/9/16 | 苏友江 |  创建该文件
********************************************************************************/
#ifndef NET_LINK_NODE_H
#define NET_LINK_NODE_H

typedef enum {
    NODE_ADD,     /* 新节点加入 */
    NODE_DEL,     /* 旧节点删除 */
    NODE_ONLINE,  /* 节点在线 */
    NODE_OFFLINE, /* 节点离线 */
} Node_change_e;

typedef void (*Inform)(INT8U type, Net_link_node_t*node);


/*******************************************************************
** 函数名:      net_link_node_find_by_addr
** 函数描述:    根据地址查找网络节点
** 参数:        [in] plist: 指定链表
**              [in] addr : 查询地址       
** 返回:        Net_link_node_t
********************************************************************/
Net_link_node_t* net_link_node_find_by_addr(LIST_T *plist, INT8U *addr);

/*******************************************************************
** 函数名:      net_link_node_find_by_addr
** 函数描述:    根据地址查找已经存在网络节点
** 参数:        [in] addr : 查询地址
** 返回:        Net_link_node_t
********************************************************************/
Net_link_node_t* net_link_node_find_exist(INT8U *addr);

/*******************************************************************
** 函数名:      net_link_node_update
** 函数描述:    只更新原有的网络节点，不创建
** 参数:        [in] addr     : 目标地址
** 返回:        Net_link_node_t
********************************************************************/
Net_link_node_t* net_link_node_update(INT8U *addr);

/*******************************************************************
** 函数名:      net_link_node_new
** 函数描述:    创建新网络节点
** 参数:        无      
** 返回:        Net_link_node_t
********************************************************************/
Net_link_node_t* net_link_node_new(void);

/*******************************************************************
** 函数名:      net_link_node_add
** 函数描述:    添加网络节点
** 参数:        [in] node: 要添加的节点
** 返回:        true or false
********************************************************************/
BOOLEAN net_link_node_add(Net_link_node_t* node);

/*******************************************************************
** 函数名:      net_link_node_manager_init
** 函数描述:    网络节点管理初始化
** 参数:        无
** 返回:        无
********************************************************************/
void net_link_node_init(void);

/*******************************************************************
** 函数名:      net_link_node_get_list
** 函数描述:    获取在线链表
** 参数:        [in] type: 链表类型
** 返回:        LIST_T
********************************************************************/
LIST_T* net_link_node_get_list(INT8U type);

/*******************************************************************
** 函数名:      net_link_node_reg
** 函数描述:    注册节点添加/删除通知回调函数
** 参数:        [in] inform: 回调函数
** 返回:        true or false
********************************************************************/
BOOLEAN  net_link_node_reg(Inform inform);

#endif /* end of NET_LINK_NODE_H */

