/********************************************************************************
**
** 文件名:     comm_manager.c
** 版权所有:   (c) 2013-2015 
** 文件描述:   通信管理模块
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**|    日期    |  作者  |  修改记录
**===============================================================================
**| 2015/090/8 | 苏友江 |  创建该文件
********************************************************************************/
#include "bsp.h"
#include "sys_includes.h"

#if DBG_COMM > 0
#define SYS_DEBUG          OS_DEBUG
#else
#define SYS_DEBUG(...)     do{}while(0)
#endif
/*
********************************************************************************
* 参数配置
********************************************************************************
*/

/*
********************************************************************************
* 结构定义
********************************************************************************
*/



/*
********************************************************************************
* 静态变量
********************************************************************************
*/
#if 0
static void _handle_0x8001(Comm_pkt_recv_t *packet)
{
    const INT8U sendbuf[10] = {"0123456789"};
    Comm_pkt_send_t pkt;
    static Lamp_event_t event = {0};

    SYS_DEBUG("_handle_0x8001\n");

#if 1
    event.event = LAMP_EVENT_ALARM;
    if (event.ctl == LAMP_CLOSE) {
        event.ctl = LAMP_OPEN;
        event.dimming = 50; 
    } else {
        event.ctl = LAMP_CLOSE;
        event.dimming = 0;
    }
    lamp_event_create(LAMP1_INDEX, &event);
    pkt.len = 10;
    pkt.pdata = (INT8U*)sendbuf;
    pkt.msgid = 0x0200;
    comm_send_listsend(&pkt, 3, 5, NULL);
#endif /* if 0. 2015-9-7 08:54:05 syj */


}

 
#endif /* if 0. 2015-10-1 20:37:57 suyoujiang */
/*
********************************************************************************
* 注册回调函数
********************************************************************************
*/
#if 0
static const FUNCENTRY_COMM_T s_functionentry[] = {
        0x8001, _handle_0x8001
};
static const INT8U s_funnum = sizeof(s_functionentry) / sizeof(s_functionentry[0]);
#endif /* if 0. 2015-10-1 18:33:36 suyoujiang */

/*******************************************************************
** 函数名:      comm_init
** 函数描述:    通讯管理模块初始化
** 参数:        无
** 返回:        无
********************************************************************/
void comm_manager_init(void)
{
	//INT8U i;

    comm_recv_init();
    comm_send_init();

#if 0
    for (i = 0; i < s_funnum; i++) {
        comm_recv_register(s_functionentry[i].index, s_functionentry[i].entryproc);
    }
#endif /* if 0. 2015-10-1 18:33:31 suyoujiang */
}


